### **Proceso de ETL**

In [1]:
#Importar las librerias a utilizar
import pandas as pd
import datetime as dt

1) PROCESAMIENTO ETL DE LOS CSV 'PLATAFORMAS'

In [4]:
#Almaceno los csv de plataformas en un dataframe de pandas
df_amazon = pd.read_csv('./Datasets/amazon_prime_titles.csv', sep= ',')
df_disney = pd.read_csv('./Datasets/disney_plus_titles.csv', sep= ',')
df_hulu = pd.read_csv('./Datasets/hulu_titles.csv', sep= ',')
df_netflix = pd.read_csv('./Datasets/netflix_titles.csv', sep= ',')

In [5]:
#Inicio el EDA en cada uno de los dataframes
df_amazon.head(3)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,The Grand Seduction,Don McKellar,"Brendan Gleeson, Taylor Kitsch, Gordon Pinsent",Canada,"March 30, 2021",2014,NaN,113 min,"Comedy, Drama",A small fishing village must procure a local d...
1,s2,Movie,Take Care Good Night,Girish Joshi,"Mahesh Manjrekar, Abhay Mahajan, Sachin Khedekar",India,"March 30, 2021",2018,13+,110 min,"Drama, International",A Metro Family decides to fight a Cyber Crimin...
2,s3,Movie,Secrets of Deception,Josh Webber,"Tom Sizemore, Lorenzo Lamas, Robert LaSardo, R...",United States,"March 30, 2021",2017,NaN,74 min,"Action, Drama, Suspense",After a man discovers his wife is cheating on ...

In [6]:
df_disney.head(3)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Duck the Halls: A Mickey Mouse Christmas Special,"Alonso Ramirez Ramos, Dave Wasson","Chris Diamantopoulos, Tony Anselmo, Tress MacN...",NaN,"November 26, 2021",2016,TV-G,23 min,"Animation, Family",Join Mickey and the gang as they duck the halls!
1,s2,Movie,Ernest Saves Christmas,John Cherry,"Jim Varney, Noelle Parker, Douglas Seale",NaN,"November 26, 2021",1988,PG,91 min,Comedy,Santa Claus passes his magic bag to a new St. ...
2,s3,Movie,Ice Age: A Mammoth Christmas,Karen Disher,"Raymond Albert Romano, John Leguizamo, Denis L...",United States,"November 26, 2021",2011,TV-G,23 min,"Animation, Comedy, Family",Sid the Sloth is on Santa's naughty list.

In [7]:
df_hulu.head(3)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Ricky Velez: Here's Everything,NaN,NaN,NaN,"October 24, 2021",2021,TV-MA,NaN,"Comedy, Stand Up",​Comedian Ricky Velez bares it all with his ho...
1,s2,Movie,Silent Night,NaN,NaN,NaN,"October 23, 2021",2020,NaN,94 min,"Crime, Drama, Thriller","Mark, a low end South London hitman recently r..."
2,s3,Movie,The Marksman,NaN,NaN,NaN,"October 23, 2021",2021,PG-13,108 min,"Action, Thriller",A hardened Arizona rancher tries to protect an...

In [8]:
df_netflix.head(3)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...

In [9]:
#Veo la información general de cada dataframe cantidad de valores nulos y cantidad de valores duplicados
df_amazon.info()
print("-----------------------------------")
print(df_amazon.isnull().sum())
print('-----------------------------------')
df_amazon.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9668 entries, 0 to 9667
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       9668 non-null   object
 1   type          9668 non-null   object
 2   title         9668 non-null   object
 3   director      7586 non-null   object
 4   cast          8435 non-null   object
 5   country       672 non-null    object
 6   date_added    155 non-null    object
 7   release_year  9668 non-null   int64
 8   rating        9331 non-null   object
 9   duration      9668 non-null   object
 10  listed_in     9668 non-null   object
 11  description   9668 non-null   object
dtypes: int64(1), object(11)
memory usage: 906.5+ KB
-----------------------------------
show_id            0
type               0
title              0
director        2082
cast            1233
country         8996
date_added      9513
release_year       0
rating           337
duration           0
listed_in          0
description        0
dtype: int64
-----------------------------------

0

In [10]:
df_disney.info()
print("-----------------------------------")
print(df_disney.isnull().sum())
print('-----------------------------------')
df_disney.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1450 entries, 0 to 1449
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       1450 non-null   object
 1   type          1450 non-null   object
 2   title         1450 non-null   object
 3   director      977 non-null    object
 4   cast          1260 non-null   object
 5   country       1231 non-null   object
 6   date_added    1447 non-null   object
 7   release_year  1450 non-null   int64
 8   rating        1447 non-null   object
 9   duration      1450 non-null   object
 10  listed_in     1450 non-null   object
 11  description   1450 non-null   object
dtypes: int64(1), object(11)
memory usage: 136.1+ KB
-----------------------------------
show_id           0
type              0
title             0
director        473
cast            190
country         219
date_added        3
release_year      0
rating            3
duration          0
listed_in         0
description       0
dtype: int64
-----------------------------------

0

In [11]:
df_hulu.info()
print("-----------------------------------")
print(df_hulu.isnull().sum())
print('-----------------------------------')
df_hulu.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3073 entries, 0 to 3072
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       3073 non-null   object
 1   type          3073 non-null   object
 2   title         3073 non-null   object
 3   director      3 non-null      object
 4   cast          0 non-null      float64
 5   country       1620 non-null   object
 6   date_added    3045 non-null   object
 7   release_year  3073 non-null   int64
 8   rating        2553 non-null   object
 9   duration      2594 non-null   object
 10  listed_in     3073 non-null   object
 11  description   3069 non-null   object
dtypes: float64(1), int64(1), object(10)
memory usage: 288.2+ KB
-----------------------------------
show_id            0
type               0
title              0
director        3070
cast            3073
country         1453
date_added        28
release_year       0
rating           520
duration         479
listed_in          0
description        4
dtype: int64
-----------------------------------

0

In [12]:
df_netflix.info()
print("-----------------------------------")
print(df_netflix.isnull().sum())
print('-----------------------------------')
df_netflix.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB
-----------------------------------
show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64
-----------------------------------

0

In [13]:
# Cambio el tipo de dato de las columnas:
df_amazon['show_id'] = df_amazon['show_id'].astype('string')
df_amazon["type"] = df_amazon["type"].astype("string")
df_amazon["title"] = df_amazon["title"].astype("string")
df_amazon["director"] = df_amazon["director"].astype("string")
df_amazon["cast"] = df_amazon["cast"].astype("string")
df_amazon["country"] = df_amazon["country"].astype("string")
df_amazon["date_added"] = pd.to_datetime(df_amazon["date_added"]).dt.date
df_amazon["release_year"] = df_amazon["release_year"].astype("string")
df_amazon["rating"] = df_amazon["rating"].astype("string")
df_amazon["duration"] = df_amazon["duration"].astype("string")
df_amazon["listed_in"] = df_amazon["listed_in"].astype("string")
df_amazon["description"] = df_amazon["description"].astype("string")

In [14]:
df_disney["show_id"] = df_disney["show_id"].astype("string")
df_disney["type"] = df_disney["type"].astype("string")
df_disney["title"] = df_disney["title"].astype("string")
df_disney["director"] = df_disney["director"].astype("string")
df_disney["cast"] = df_disney["cast"].astype("string")
df_disney["country"] = df_disney["country"].astype("string")
df_disney["date_added"] = pd.to_datetime(df_disney["date_added"]).dt.date
df_disney["release_year"] = df_disney["release_year"].astype("string")
df_disney["rating"] = df_disney["rating"].astype("string")
df_disney["duration"] = df_disney["duration"].astype("string")
df_disney["listed_in"] = df_disney["listed_in"].astype("string")
df_disney["description"] = df_disney["description"].astype("string")

In [15]:
df_hulu["show_id"] = df_hulu["show_id"].astype("string")
df_hulu["type"] = df_hulu["type"].astype("string")
df_hulu["title"] = df_hulu["title"].astype("string")
df_hulu["director"] = df_hulu["director"].astype("string")
df_hulu["cast"] = df_hulu["cast"].astype("string")
df_hulu["country"] = df_hulu["country"].astype("string")
df_hulu["date_added"] = pd.to_datetime(df_hulu["date_added"]).dt.date
df_hulu["release_year"] = df_hulu["release_year"].astype("string")
df_hulu["rating"] = df_hulu["rating"].astype("string")
df_hulu["duration"] = df_hulu["duration"].astype("string")
df_hulu["listed_in"] = df_hulu["listed_in"].astype("string")
df_hulu["description"] = df_hulu["description"].astype("string")

In [16]:
df_netflix["show_id"] = df_netflix["show_id"].astype("string")
df_netflix["type"] = df_netflix["type"].astype("string")
df_netflix["title"] = df_netflix["title"].astype("string")
df_netflix["director"] = df_netflix["director"].astype("string")
df_netflix["cast"] = df_netflix["cast"].astype("string")
df_netflix["country"] = df_netflix["country"].astype("string")
df_netflix["date_added"] = pd.to_datetime(df_netflix["date_added"]).dt.date
df_netflix["release_year"] = df_netflix["release_year"].astype("string")
df_netflix["rating"] = df_netflix["rating"].astype("string")
df_netflix["duration"] = df_netflix["duration"].astype("string")
df_netflix["listed_in"] = df_netflix["listed_in"].astype("string")
df_netflix["description"] = df_netflix["description"].astype("string")

In [17]:
# Genero campo id: Cada id se compondrá de la primera letra del nombre de la plataforma, seguido del show_id ya presente en los datasets:

df_amazon.insert(0, 'id', df_amazon['show_id'], allow_duplicates=False)
df_amazon['id'] = 'a' + df_amazon['show_id']

df_disney.insert(0, 'id', df_disney['show_id'], allow_duplicates=False)
df_disney['id'] = 'd' + df_disney['show_id']

df_hulu.insert(0, 'id', df_hulu['show_id'], allow_duplicates=False)
df_hulu['id'] = 'h' + df_hulu['show_id']

df_netflix.insert(0, 'id', df_netflix['show_id'], allow_duplicates=False)
df_netflix['id'] = 'n' + df_netflix['show_id']

In [18]:
# Genero una columna con el nombre de cada plataforma
df_amazon['plataforma'] = 'amazon'
df_disney['plataforma'] = 'disney'
df_hulu['plataforma'] = 'hulu'
df_netflix['plataforma'] = 'netflix'

In [19]:
# El campo duration debe convertirse en dos campos: 'duration_int' y 'duration_type'. El primero será un integer y el segundo un string indicando la unidad de medición de duración: min (minutos) o season (temporadas) 
div = df_amazon['duration'].str.split(" ", n=1, expand=True)
df_amazon['duration_int'] = div[0]
df_amazon['duration_type'] = div[1]

In [20]:
div = df_disney['duration'].str.split(" ", n=1, expand=True)
df_disney['duration_int'] = div[0]
df_disney['duration_type'] = div[1]

In [21]:
div = df_hulu['duration'].str.split(" ", n=1, expand=True)
df_hulu['duration_int'] = div[0]
df_hulu['duration_type'] = div[1]

In [22]:
div = df_netflix["duration"].str.split(" ", n=1, expand=True)
df_netflix["duration_int"] = div[0]
df_netflix["duration_type"] = div[1]

In [23]:
# Elimino la columna 'duration' ya que no aportaría informacion valiosa: 
df_amazon.drop(['duration'], axis=1, inplace=True)
df_disney.drop(['duration'], axis=1, inplace=True)
df_hulu.drop(['duration'], axis=1, inplace=True)
df_netflix.drop(['duration'], axis=1, inplace=True)

In [24]:
# Los valores nulos del campo rating son reemplazardos por el string “G” (corresponde al maturity rating: “general for all audiences”):
df_amazon.rating.fillna('G', inplace=True)
df_disney.rating.fillna('G', inplace=True)
df_hulu.rating.fillna('G', inplace=True)
df_netflix.rating.fillna('G', inplace=True)

In [25]:
# Modifico los campos de txt para que estén todos en minúsculas:
df_amazon['type'] = df_amazon['type'].str.lower()
df_amazon['title'] = df_amazon['title'].str.lower()
df_amazon['director'] = df_amazon['director'].str.lower()
df_amazon['cast'] = df_amazon['cast'].str.lower()
df_amazon['country'] = df_amazon['country'].str.lower()
df_amazon['rating'] = df_amazon['rating'].str.lower()
df_amazon['listed_in'] = df_amazon['listed_in'].str.lower()
df_amazon['description'] = df_amazon['description'].str.lower()

In [26]:
df_disney['type'] = df_disney['type'].str.lower()
df_disney['title'] = df_disney['title'].str.lower()
df_disney['director'] = df_disney['director'].str.lower()
df_disney['cast'] = df_disney['cast'].str.lower()
df_disney['country'] = df_disney['country'].str.lower()
df_disney['rating'] = df_disney['rating'].str.lower()
df_disney['listed_in'] = df_disney['listed_in'].str.lower()
df_disney['description'] = df_disney['description'].str.lower()

In [27]:
df_hulu['type'] = df_hulu['type'].str.lower()
df_hulu['title'] = df_hulu['title'].str.lower()
df_hulu['director'] = df_hulu['director'].str.lower()
df_hulu['cast'] = df_hulu['cast'].str.lower()
df_hulu['country'] = df_hulu['country'].str.lower()
df_hulu['rating'] = df_hulu['rating'].str.lower()
df_hulu['listed_in'] = df_hulu['listed_in'].str.lower()
df_hulu['description'] = df_hulu['description'].str.lower()

In [28]:
df_netflix['type'] = df_netflix['type'].str.lower()
df_netflix['title'] = df_netflix['title'].str.lower()
df_netflix['director'] = df_netflix['director'].str.lower()
df_netflix['cast'] = df_netflix['cast'].str.lower()
df_netflix['country'] = df_netflix['country'].str.lower()
df_netflix['rating'] = df_netflix['rating'].str.lower()
df_netflix['listed_in'] = df_netflix['listed_in'].str.lower()
df_netflix['description'] = df_netflix['description'].str.lower()

In [29]:
#Transformo el tipo de dato de la columna "duration_int" a entero:
df_amazon['duration_int'] = df_amazon['duration_int'].astype("Int64")
df_disney['duration_int'] = df_disney['duration_int'].astype("Int64")
df_hulu['duration_int'] = df_hulu['duration_int'].astype("Int64")
df_netflix['duration_int'] = df_netflix['duration_int'].astype("Int64")

In [30]:
df_netflix.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             8807 non-null   string
 1   show_id        8807 non-null   string
 2   type           8807 non-null   string
 3   title          8807 non-null   string
 4   director       6173 non-null   string
 5   cast           7982 non-null   string
 6   country        7976 non-null   string
 7   date_added     8797 non-null   object
 8   release_year   8807 non-null   string
 9   rating         8807 non-null   string
 10  listed_in      8807 non-null   string
 11  description    8807 non-null   string
 12  plataforma     8807 non-null   object
 13  duration_int   8804 non-null   Int64
 14  duration_type  8804 non-null   string
dtypes: Int64(1), object(2), string(12)
memory usage: 1.0+ MB

In [31]:
# Concateno los dataframes de plataformas
df_platforms = pd.concat([df_amazon, df_disney, df_hulu, df_netflix])

In [32]:
# Veo la información general del dataframe 'platforms'
df_platforms.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22998 entries, 0 to 8806
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             22998 non-null  string
 1   show_id        22998 non-null  string
 2   type           22998 non-null  string
 3   title          22998 non-null  string
 4   director       14739 non-null  string
 5   cast           17677 non-null  string
 6   country        11499 non-null  string
 7   date_added     13444 non-null  object
 8   release_year   22998 non-null  string
 9   rating         22998 non-null  string
 10  listed_in      22998 non-null  string
 11  description    22994 non-null  string
 12  plataforma     22998 non-null  object
 13  duration_int   22516 non-null  Int64
 14  duration_type  22516 non-null  string
dtypes: Int64(1), object(2), string(12)
memory usage: 2.8+ MB

In [33]:
# Exporto el archivo a un csv nuevo:
df_platforms.to_csv("platforms.csv", index=False)

2) PROCESAMIENTO ETL DE LOS CSV 'RATINGS'

In [3]:
# Almaceno los csv de plataformas en dataframes de pandas
df_1 = pd.read_csv('./Datasets/1.csv', sep=',')
df_2 = pd.read_csv('./Datasets/2.csv', sep=',')
df_3 = pd.read_csv('./Datasets/3.csv', sep=',')
df_4 = pd.read_csv('./Datasets/4.csv', sep=',')
df_5 = pd.read_csv('./Datasets/5.csv', sep=',')
df_6 = pd.read_csv('./Datasets/6.csv', sep=',')
df_7 = pd.read_csv('./Datasets/7.csv', sep=',')
df_8 = pd.read_csv('./Datasets/8.csv', sep=',')

In [78]:
# Inicio el EDA en cada uno de los dataframes
df_1.head(3)

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186
2       1     5.0  1425941523  hs2381

In [79]:
df_2.head(3)

   userId  rating   timestamp movieId
0   15424     3.0  1369585147  ns3012
1   15424     2.5  1369586851  ns3195
2   15424     3.0  1369585112   ns357

In [80]:
df_3.head(3)

   userId  rating  timestamp movieId
0   31332     4.0  974205261  as2251
1   31332     3.0  974205170  as7226
2   31332     3.0  974205034  as6479

In [81]:
df_4.head(3)

   userId  rating   timestamp movieId
0   46200     5.0  1015603683  as3203
1   46200     1.0  1012323069  as5959
2   46200     3.0   996245609  as4430

In [82]:
df_5.head(3)

   userId  rating   timestamp movieId
0   61768     4.0  1438075492  as5376
1   61768     3.0  1435693148  as7172
2   61768     3.0  1438075482  ns4557

In [83]:
df_6.head(3)

   userId  rating   timestamp movieId
0  249182     3.5  1460518555   ds327
1  249182     4.0  1461878500  ns2124
2  249182     3.0  1460182087  as8841

In [84]:
df_7.head(3)

   userId  rating  timestamp movieId
0  265409     5.0  891417042   ds781
1  265409     5.0  891417042  as9331
2  265409     4.0  891417435   hs384

In [85]:
df_8.head(3)

   userId  rating   timestamp movieId
0  108422     4.5  1350689762  as1399
1  108422     4.0  1350341401  as6724
2  108422     5.0  1350689691   ns512

In [35]:
# Veo la información general de cada dataframe, cantidad de valores nulos y cantidad de valores duplicados
df_1.info()
print("-----------------------------------")
print(df_1.isnull().sum())
print('-----------------------------------')
df_1.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

14

In [87]:
df_2.info()
print("-----------------------------------")
print(df_2.isnull().sum())
print('-----------------------------------')
df_2.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

10

In [88]:
df_3.info()
print("-----------------------------------")
print(df_3.isnull().sum())
print('-----------------------------------')
df_3.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

23

In [89]:
df_4.info()
print("-----------------------------------")
print(df_4.isnull().sum())
print('-----------------------------------')
df_4.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

18

In [90]:
df_5.info()
print("-----------------------------------")
print(df_5.isnull().sum())
print('-----------------------------------')
df_5.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

8

In [91]:
df_6.info()
print("-----------------------------------")
print(df_6.isnull().sum())
print('-----------------------------------')
df_6.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

22

In [92]:
df_7.info()
print("-----------------------------------")
print(df_7.isnull().sum())
print('-----------------------------------')
df_7.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524289 entries, 0 to 524288
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     524289 non-null  int64
 1   rating     524289 non-null  float64
 2   timestamp  524289 non-null  int64
 3   movieId    524289 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 16.0+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

9

In [93]:
df_8.info()
print("-----------------------------------")
print(df_8.isnull().sum())
print('-----------------------------------')
df_8.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500000 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   userId     1500000 non-null  int64
 1   rating     1500000 non-null  float64
 2   timestamp  1500000 non-null  int64
 3   movieId    1500000 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 45.8+ MB
-----------------------------------
userId       0
rating       0
timestamp    0
movieId      0
dtype: int64
-----------------------------------

20

In [4]:
# Cambio el tipo de dato de la columna 'timestamp':
df_1["timestamp"] = pd.to_datetime(df_1["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_2["timestamp"] = pd.to_datetime(df_2["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_3["timestamp"] = pd.to_datetime(df_3["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_4["timestamp"] = pd.to_datetime(df_4["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_5["timestamp"] = pd.to_datetime(df_5["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_6["timestamp"] = pd.to_datetime(df_6["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_7["timestamp"] = pd.to_datetime(df_7["timestamp"], unit='s').dt.strftime('%Y-%m-%d')
df_8["timestamp"] = pd.to_datetime(df_8["timestamp"], unit='s').dt.strftime('%Y-%m-%d')

In [5]:
df_1["timestamp"] = pd.to_datetime(df_1["timestamp"])
df_2["timestamp"] = pd.to_datetime(df_2["timestamp"])
df_3["timestamp"] = pd.to_datetime(df_3["timestamp"])
df_4["timestamp"] = pd.to_datetime(df_4["timestamp"])
df_5["timestamp"] = pd.to_datetime(df_5["timestamp"])
df_6["timestamp"] = pd.to_datetime(df_6["timestamp"])
df_7["timestamp"] = pd.to_datetime(df_7["timestamp"])
df_8["timestamp"] = pd.to_datetime(df_8["timestamp"])

In [6]:
# Renombro la columna ''rating' por un nombre más apropiado ('score'):
df_1.rename(columns={'rating': 'score'}, inplace=True)
df_2.rename(columns={'rating': 'score'}, inplace=True)
df_3.rename(columns={'rating': 'score'}, inplace=True)
df_4.rename(columns={'rating': 'score'}, inplace=True)
df_5.rename(columns={'rating': 'score'}, inplace=True)
df_6.rename(columns={'rating': 'score'}, inplace=True)
df_7.rename(columns={'rating': 'score'}, inplace=True)
df_8.rename(columns={'rating': 'score'}, inplace=True)

In [7]:
# Renombro la columna ''movieId' por 'id':
df_1.rename(columns={'movieId': 'id'}, inplace=True)
df_2.rename(columns={'movieId': 'id'}, inplace=True)
df_3.rename(columns={'movieId': 'id'}, inplace=True)
df_4.rename(columns={'movieId': 'id'}, inplace=True)
df_5.rename(columns={'movieId': 'id'}, inplace=True)
df_6.rename(columns={'movieId': 'id'}, inplace=True)
df_7.rename(columns={'movieId': 'id'}, inplace=True)
df_8.rename(columns={'movieId': 'id'}, inplace=True)

In [8]:
# Visualizo un dataframe para corroborar los cambios realizados
df_1.head()

   userId  score  timestamp      id
0       1    1.0 2015-03-09   as680
1       1    4.5 2015-03-09  ns2186
2       1    5.0 2015-03-09  hs2381
3       1    5.0 2015-03-09  ns3663
4       1    5.0 2015-03-09  as9500

In [9]:
# Concateno los dataframes de plataformas
df_score = pd.concat([df_1, df_2, df_3, df_4, df_5, df_6, df_7, df_8])

In [52]:
df_score.info()
print("-----------------------------------")
print(df_score.isnull().sum())
print('-----------------------------------')
df_score.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11013823 entries, 0 to 1499999
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   score      float64
 2   timestamp  datetime64[ns]
 3   id         object
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 420.1+ MB
-----------------------------------
userId       0
score        0
timestamp    0
id           0
dtype: int64
-----------------------------------

0

In [12]:
# Exporto el archivo a un parquet nuevo:
df_score.to_parquet("score_total.parquet", index=False)

In [44]:
# Creo un dataframe con los valores promedios de score agrupado por id 
df_score_mean = df_score.groupby('id').score.mean().reset_index()

In [45]:
# Redondeo los valores de score a 1 decimal:
df_score_mean['score_r'] = df_score_mean['score'].map(lambda x: '%.1f' % x)

In [46]:
# Elimino la columna score y renombro a score_r
df_score_mean.drop(['score'], axis=1, inplace=True)
df_score_mean.rename(columns={'score_r': 'score'}, inplace=True)

In [47]:
df_score_mean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22998 entries, 0 to 22997
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      22998 non-null  object
 1   score   22998 non-null  object
dtypes: object(2)
memory usage: 359.5+ KB

In [ ]:
# Fusiono los dos datasets
platform_score = pd.merge(df_platforms, df_score_mean)

In [56]:
# Visualizo la información
platform_score.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22998 entries, 0 to 22997
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             22998 non-null  object
 1   show_id        22998 non-null  string
 2   type           22998 non-null  string
 3   title          22998 non-null  string
 4   director       14739 non-null  string
 5   cast           17677 non-null  string
 6   country        11499 non-null  string
 7   date_added     13444 non-null  object
 8   release_year   22998 non-null  string
 9   rating         22998 non-null  string
 10  listed_in      22998 non-null  string
 11  description    22994 non-null  string
 12  plataforma     22998 non-null  object
 13  duration_int   22516 non-null  Int64
 14  duration_type  22516 non-null  string
 15  score          22998 non-null  object
dtypes: Int64(1), object(4), string(11)
memory usage: 3.0+ MB

In [51]:
# Exporto el archivo a un csv nuevo:
platform_score.to_csv("platform_score.csv", index=False)